In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns 
import matplotlib.pyplot as plt 


from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [2]:
df=pd.read_csv('train.csv')[['Age','SibSp','Pclass','Parch','Survived']]

In [3]:
df.dropna(inplace=True)

In [4]:
df.head()

    Age  SibSp  Pclass  Parch  Survived
0  22.0      1       3      0         0
1  38.0      1       1      0         1
2  26.0      0       3      0         1
3  35.0      1       1      0         1
4  35.0      0       3      0         0

In [5]:
x=df.iloc[:,0:4]
y=df.iloc[:,-1]

In [6]:
x.head()

    Age  SibSp  Pclass  Parch
0  22.0      1       3      0
1  38.0      1       1      0
2  26.0      0       3      0
3  35.0      1       1      0
4  35.0      0       3      0

In [7]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring='accuracy',cv=20))

np.float64(0.6933333333333332)

# applying  feature construction

In [8]:
x['Family_size']=x['SibSp']+x['Parch']+1

In [9]:
x.head()

    Age  SibSp  Pclass  Parch  Family_size
0  22.0      1       3      0            2
1  38.0      1       1      0            2
2  26.0      0       3      0            1
3  35.0      1       1      0            2
4  35.0      0       3      0            1

In [10]:
def myfunc(num):
    if num==1:
        return 0 # alone
    elif num>1 and num <=4:
        return 1 # small family 
    else:
        return 2 # large family

In [11]:
myfunc(8)

2

In [12]:
x['family_type']=x['Family_size'].apply(myfunc)

In [13]:
x.head()

    Age  SibSp  Pclass  Parch  Family_size  family_type
0  22.0      1       3      0            2            1
1  38.0      1       1      0            2            1
2  26.0      0       3      0            1            0
3  35.0      1       1      0            2            1
4  35.0      0       3      0            1            0

In [14]:
x.drop(columns=['SibSp','Parch','Family_size'],inplace=True)

In [15]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring='accuracy',cv=20))

np.float64(0.7003174603174602)

# Feature Splitting

In [17]:
df=pd.read_csv('train.csv')

In [18]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [22]:
df['Title']=df['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]

In [26]:
df[['Title','Name']]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [30]:
(df.groupby('Title')['Survived'].mean()).sort_values(ascending=False)

Title
Lady            1.000000
Ms              1.000000
Sir             1.000000
Mme             1.000000
the Countess    1.000000
Mlle            1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Major           0.500000
Col             0.500000
Dr              0.428571
Mr              0.156673
Capt            0.000000
Jonkheer        0.000000
Don             0.000000
Rev             0.000000
Name: Survived, dtype: float64

In [33]:
df['Is_Married']=0
df['Is_Married'].loc[df['Title']=='Mrs']=1

C:\Users\ACER\AppData\Local\Temp\ipykernel_21068\3104783197.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Is_Married'].loc[df['Title']=='Mrs']=1
C:\Users\ACER\AppData\Local\Temp\ipykernel_21068\3104783197.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['Title']=='Mrs']=1

In [34]:
df['Is_Married']

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64